# Creating DataFrame using dictionary data

In [1]:
import pandas as pd
import numpy as np

In [2]:
cars={'Brand':['Honda','Toyoto','Ford','Audi'],
      'Price':[22000,25000,27000,35000]}

In [3]:
df=pd.DataFrame(cars)
df

    Brand  Price
0   Honda  22000
1  Toyoto  25000
2    Ford  27000
3    Audi  35000

# Creating Data Frame using list data

In [4]:
lst=['Arun','Borun','Ram','Mohan']
df=pd.DataFrame(lst)
df

       0
0   Arun
1  Borun
2    Ram
3  Mohan

In [5]:
names=['Arun','Borun','Ram','Mohan'] ###creating multiple column
age=[29,21,32,51]
height_cm=[150,160,155,160]
df=pd.DataFrame(list(zip(names,age,height_cm)))
df

       0   1    2
0   Arun  29  150
1  Borun  21  160
2    Ram  32  155
3  Mohan  51  160

In [6]:
names=['Arun','Borun','Ram','Mohan'] ###creating multiple column
age=[29,21,32,51]
height_cm=[150,160,155,160]
roll=[101,102,103,104]
cgpa=[3.56,3.89,3.50,3.78]
weight=[60,67,56,70]
df=pd.DataFrame(list(zip(names,roll,cgpa,age,height_cm,weight)))
df

       0    1     2   3    4   5
0   Arun  101  3.56  29  150  60
1  Borun  102  3.89  21  160  67
2    Ram  103  3.50  32  155  56
3  Mohan  104  3.78  51  160  70

In [7]:
df=pd.DataFrame(list(zip(names,roll,cgpa,age,height_cm,weight)),columns=['name','roll','cgpa','age','Height_cm','weight'])
df

    name  roll  cgpa  age  Height_cm  weight
0   Arun   101  3.56   29        150      60
1  Borun   102  3.89   21        160      67
2    Ram   103  3.50   32        155      56
3  Mohan   104  3.78   51        160      70

In [8]:
names=['Arun','Borun','Ram','Mohan'] ###creating multiple column and remaining column name
age=[29,21,32,51]
height_cm=[150,160,155,160]
df=pd.DataFrame(list(zip(names,age,height_cm)),columns=['Name','Age','Height in cm'])
df

    Name  Age  Height in cm
0   Arun   29           150
1  Borun   21           160
2    Ram   32           155
3  Mohan   51           160

# Creating DataFrame from list pf dicionaries

In [9]:
lst=[
    {'Name':'Uzzal','Age':23,'Gender':'M'},
     {'Name':'Arun','Age':21,'Gender':'M'},
     {'Name':'Varun','Age':29,'Gender':'M'},
     {'Name':'Ram','Age':28,'Gender':'M'},
     {'Name':'Shila','Age':23,'Gender':'F'},
]

In [10]:
df=pd.DataFrame(lst)
df

    Name  Age Gender
0  Uzzal   23      M
1   Arun   21      M
2  Varun   29      M
3    Ram   28      M
4  Shila   23      F

# Creating Blank Data frame

In [19]:
df=pd.DataFrame 
df

pandas.core.frame.DataFrame

In [20]:
df=pd.DataFrame(columns=['Name','Age','Height','weight'])
df

Empty DataFrame
Columns: [Name, Age, Height, weight]
Index: []

In [11]:
tup=('Arun','Borun','Ram','Mohan')
df=pd.DataFrame(tup)
df

       0
0   Arun
1  Borun
2    Ram
3  Mohan

In [12]:
se_t={'Arun','Borun','Ram','Mohan'}
df=pd.DataFrame(se_t)
df

       0
0    Ram
1   Arun
2  Borun
3  Mohan